Revit 2027 API
ParameterTypeId.Profile1FamType Property
 "Profile"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId Profile1FamType { get; }
Public Shared ReadOnly Property Profile1FamType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ Profile1FamType {
	ForgeTypeId^ get ();
}
static member Profile1FamType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace